Revit 2024 API
View.UpDirection Property
The direction towards the top of the screen.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ UpDirection { get; }
Visual Basic
Public ReadOnly Property UpDirection As XYZ
	Get
Visual C++
public:
property XYZ^ UpDirection {
	XYZ^ get ();
}
See Also
View Class
Autodesk.Revit.DB Namespace